# Selecting Subsets of Data from DataFrames with `iloc`

## Overview

### Objectives

+ `iloc` can select rows, columns, or rows and columns simultaneously
+ `iloc` selects only by **integer location**

## Getting started with `iloc`
The `iloc` indexer is very similar to `loc` but only uses **integer location** to make its selections. The word `iloc` itself stands for integer location so that should help remind you what it does.

### Simultaneous row and column subset selection with `iloc`
Selection with iloc will look like the following:

```
df.iloc[rows, cols]
```

In [1]:
import pandas as pd
df = pd.read_csv('../data/sample_data.csv', index_col=0)
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

### Use a list for both rows and columns

Let's select rows with integer location 2 and 4 along with the first and last columns. It is possible to use negative integers in the same manner as Python lists.

In [2]:
rows = [2, 4]
cols = [0, -1]
df.iloc[rows, cols]

      state  score
Aaron    FL    9.0
Dean     AK    1.8

### The possible types of selections for `iloc`
Row or column selections can be any of the following:

* A single integer
* A list of integers
* A slice with integers

### Slice the rows and use a list for the columns

In [3]:
cols = [4, 2]
df.iloc[::2, cols]

          height    food
Jane         165   Steak
Aaron        120   Mango
Dean         180  Cheese
Cornelia     150   Beans

### Use a list for the rows and a slice for the columns

In [4]:
rows = [5, 2, 4]
df.iloc[rows, 3:]

           age  height  score
Christina   33     172    9.5
Aaron       12     120    9.0
Dean        32     180    1.8

### Selecting some rows and all of the columns
If you leave the column selection empty, then all of the columns will be selected.

In [5]:
rows = [3, 2]
df.iloc[rows]

         state  color   food  age  height  score
Penelope    AL  white  Apple    4      80    3.3
Aaron       FL    red  Mango   12     120    9.0

It is possible to rewrite the above with both row and column selections by using a colon to represent a slice of all of the columns. Just as with `loc`, this can be instructive and reinforce the concept that the `iloc` does simultaneous row and column selection with the row selection coming first.

In [6]:
df.iloc[rows, :]

         state  color   food  age  height  score
Penelope    AL  white  Apple    4      80    3.3
Aaron       FL    red  Mango   12     120    9.0

### Select all of the rows and some of the columns

In [ ]:
cols = [1, 5]
df.iloc[:, cols]

### Cannot do this with *just the brackets*
Just the brackets does select columns but it only understands **labels** and not **integer location**. The following produces an error as pandas is looking for column names that are the integers `1` and `5`.

In [ ]:
cols = [1, 5]
df[cols]

### Select some rows and a single column
Note that a Series is returned whenever a single row or column is selected.

In [ ]:
rows = [2, 3, 5]
cols = 4
df.iloc[rows, cols]

### A trick to select a single row row or column as a DataFrame and NOT a Series
You can select a single row (or column) and return a DataFrame and not a Series if you use a list to make the selection.

In [ ]:
rows = [2, 3, 5]
cols = [4]
df.iloc[rows, cols]

### Select a single row as a Series with `iloc`
By passing a single integer to `iloc`, it will select one row as a Series:

In [ ]:
df.iloc[2]

## Summary of `iloc`
The `iloc` indexer is analogous to `loc` but only uses **integer location** for selection. The official pandas documentation refers to this as selection by **position**.

## Exericses
* Use the movie dataset for the following exercises

### Exercise 1
<span  style="color:green; font-size:16px">Select the rows with integer location 10, 5, and 1</span>

### Exericse 2
<span  style="color:green; font-size:16px">Select the columns with integer location 10, 5, and 1</span>

### Exercise 3
<span  style="color:green; font-size:16px">Select rows with integer location 100 to 104 along with the column integer location 5.</span>